Revit 2026 API

# NumberingSchemaNumberingParameterId Property

---

Id of the parameter that stores values of the numbers on enumerated elements.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId NumberingParameterId { get; }
```
```vb
Public ReadOnly Property NumberingParameterId As ElementId
	Get
```
```cpp
public:
property ElementId^ NumberingParameterId {
	ElementId^ get ();
}
```
```fsharp
member NumberingParameterId : ElementId with get
```

#### Property Value

ElementId

Values of numbers can be obtained by querying this parameter for the respective numbered element.

_Note: The parameter can be changed directly, but if a value that already exists in the sequence is provided a warning will be presented asking the user to select a proper course of action. Programmatically with better control the value can be changed(with restrictions) using theChangeNumber(String, Int32, Int32) method._

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace